; тест - сравнить равно ли значение 16
r1 <- 16
r2 <- 16 
rf <- r1 ~ r2			; сравнение
						; если r1 равно r2 то в rf бит Z устанавливается в 1 (почему?)
rc <- @case2 (z)		; проверяем бит Z. Если установлен, то
						; переход по адресу @case2 (для примера), т.е. сравнение истинно
						; иначе продолжает выполнять действия дальше
						; по адресу @0x0d лежит команда r0 <- 0x10
case1:	r0 <- 0x15		; выполняется по умолчанию, если перехода не было
case2:	r0 <- 0x10		; переход сюда, если r1 равно r2
