; тест - написать свой цикл
LOOP:	r0 <- 0			; r0 будет счётчиком цикла. Зануляем его
		r1 <- 15		; r1 будет хранить значение при котором цикл остановится - 15
						; сравниваем достиг ли счётчик цикла остановочного значения
CHECK:	rf <- r0 ~ r1	; если r0 равен r1, то в rf установится флаг Z
		rc <- @EXIT (z)	; если достиг, то выходим из цикла
						; иначе 
BODY:	r0 <- r0++		; начинаем тело цикла
		rc <- @CHECK	; перейти к проверке условия цикла					


EXIT:	rc <- @HLT     ; выход из цикла. сейчас ведёт к остановке программы
HLT:	rc <- @HLT     ; стоп
