; !!! ПРИ ВНЕСЕНИИ ЛЮБЫХ ИЗМЕНЕНИЙ В КОД, ПРОВЕРЯТЬ МОДИФИЦИРУЮЩИЙСЯ АДРЕС

; Вариант 31
; Найти количество ячеек со значением 0xFF в 16 ячейках, начиная с ячейки,
; следующей после указанной в @0xFE. Записать результат в ячейку 0xFF.

; Подготовка тестовых данных
; 1. Устанавливаем адрес начала участка памяти
r0 <- 0x80
@0xfe <- r0
; 2. Устанваливаем числа в этот участок памяти
r0 <- 0xff
@0x81 <- r0
r0 <- 0xfe
@0x82 <- r0
r0 <- 0xfe
@0x83 <- r0
r0 <- 0xff
@0x84 <- r0
r0 <- 0xff
@0x85 <- r0
r0 <- 0xf0
@0x86 <- r0
r0 <- 0x1f
@0x87 <- r0
r0 <- 0xff
@0x88 <- r0
r0 <- 0xff
@0x89 <- r0
r0 <- 0xff
@0x8a <- r0
r0 <- 0x01
@0x8b <- r0
r0 <- 0xff
@0x8c <- r0
r0 <- 0x9f
@0x8d <- r0
r0 <- 0xff
@0x8e <- r0
r0 <- 0xff
@0x8f <- r0
r0 <- 0x1f
@0x90 <- r0

BEGIN:      r1 <- 0
            @0xfa <- r1           ; счётчик чисел
            r2 <- 0
            @0xfb <- r2           ; счётчик цикла        
LOOP:       r3 <- 16              ; значение предела цикла
            rf <- r2 ~ r3         ; начало цикла. счётчик цикла равен пределу ?
            rc <- @LOOP_QUIT (Z)  ; если да, выходим из цикла
                                  ; иначе
            r0 <- @0xfe           ; загружаем текущий адрес из 0xfe
            r0 <- r0++            ; увеличиваем его на 1, для перехода к следующей ячейке
            @0xfe <- r0           ; сохраняем обратно в 0xfe
            @0x59 <- r0           ; модифицируем адрес чтения. После сборки найти 20 59 10 00. Вписать вместо 59 в этой мнемонике ввести адрес байта с 00
            r0 <- @0x00           ; МОДИФИЦИРУЮЩИЙСЯ АДРЕС. считываем значение по текущему адресу. Вместо 0x00 будет адрес, который установили в прошлой команде
            r1 <- 0xff            ; загружаем 0xff для сравнения
IF:         rf <- r0 ~ r1         ; считанное значение равно 0xff ?
            rc <- @INC_COUNT (Z)  ; если да, то переходим к увеличению счётчика чисел
            rc <- @INC_LOOP       ; иначе переходим к увеличению счётчика цикла
INC_COUNT:  r1 <- @0xfa           ; считываем текущее значение счётчика чисел
            r1 <- r1++            ; увеличиваем счётчик чисел
            @0xfa <- r1           ; записываем обратно в память
INC_LOOP:   r2 <- @0xfb           ; считываем текущее значение счётчика цикла
            r2 <- r2++            ; увеличиваем счётчик чисел
            @0xfb <- r2           ; записываем обратно в память
            rc <- @LOOP           ; переходим к проверке условия цикла
LOOP_QUIT:  r1 <- @0xfa           ; считываем значению счётчика чисел
            @0xff <- r1           ; записываем результат
STOP:       rc <- @STOP           ; стоп