#!/bin/sh

set -eu

PROGRAM="./prg1mamN3149"
TEST_NUMBER=0

run_test() {
    input=$1
    expected=$2
    actual=$($PROGRAM "$input" | tail -n 1 )
    TEST_NUMBER=$((TEST_NUMBER + 1))

    if [ "$actual" != "$expected" ]; then
        echo "uint16_t: тест $TEST_NUMBER не пройден" >&2
        echo "Число: $input" >&2
        echo "Ожидалось: $expected" >&2
        echo "Получено:  $actual" >&2
        exit 1
    fi
}

# 00000000 00000000  исходное
# 00000000 00000000  изменённое
run_test 0 "00000000 00000000"
# 11111111 11111111  исходное
# 11111111 11111111  изменённое
run_test 65535 "11111111 11111111"
# 10101101 11101111  исходное
# 11101111 10101101  изменённое
run_test 44527 "11101111 10101101"
# 11011110 10101101  исходное
# 11011110 10101101  изменённое
run_test 57005 "11011110 10101101"
# 10111110 11101111  исходное
# 10111110 11101111  изменённое
run_test 48879 "10111110 11101111"
# 00000001 00000010  исходное
# 00000001 00000010  изменённое
run_test 258 "00000001 00000010"
# 01010101 10101010  исходное
# 01010101 10101010  изменённое
run_test 21930 "01010101 10101010"
# 11101111 00000001  исходное
# 11101111 00000001  изменённое
run_test 61185 "11101111 00000001"
# 10101101 00110100  исходное
# 00110100 10101101  изменённое
run_test 44340 "00110100 10101101"
# 00010010 00110100  исходное
# 00010010 00110100  изменённое
run_test 4660 "00010010 00110100"

echo "uint16_t: пройдено $TEST_NUMBER тестов"
