0. Написать команду сложения

r0 <- r0 + r1

Разбор и сопоставление команд 
из шестнадцатиричной системы перевести в двоичную
Найти эти двоичные коды в системе команд и сопоставить

1. Установить вручную значения битов
Запустить сложение, увидеть результат

10 + 5

2. Изменить регистр записи на r3, а сложения на r2
Увидеть, как поменялся код команды

3. Загрузить константы в регистры
r3 <- 10
r2 <- 5
r3 <- r3 + r2

4. Из регистра записи поместить значение в ячейку 0xfa
@0xfa <- r3

5. Установить значение в ячейку памяти в коде
- загрузить константу в регистр
- из регистра загрузить в ячейку по адресу
r0 <- 16
@0xfa <- r0


5. Считать значение из одной ячейки памяти и записать в другую
- считать из памяти по адресу в регистр
- из регистра загрузить в другую ячейку по адресу
r0 <- 16
@0xfa <- r0
r1 <- @0xfa
@0xfb <- r1


6. Увеличить значение ячейки на 1
- считать из памяти по адресу в регистр
- инкремент регистра
- записать обратно по тому же адресу


Редактирование регистра-указтеля команд явным образом
rc <- @0x7d
Метка
Цикл (бесконечный)


Сравнение
